{"Critical Capabilities for Digital Commerce": "Agility, customer experience and headless commerce are key features in the next wave of digital commerce platforms, as application leaders guiding B2C, B2B and B2B2C organizations try to keep pace with the digital economy.", "Critical Capabilities for Cloud HCM Suites for Midmarket and Large Enterprises": "HCM suite vendors are building out their offerings to address administrative, strategic and operational needs of users, but solutions still vary. Application leaders transforming HCM should use this research to identify best-fit vendors based on their own critical product and service/support needs.", "Critical Capabilities for Enterprise Mobility Management Suites": "Enterprise mobility management suite functionality is evolving into unified endpoint management, which adds traditional client and select EMM manageable IoT use-case management. Before selecting an EMM vendor in this constantly changing market, I&O; leaders need to determine their desired use cases.", "Magic Quadrant for Business Analytics Services, Worldwide": "Data and analytics leaders expect business analytics to drive organization performance and guide digital transformation. Service providers are changing delivery toward IP assets and automation for support. We profile 20 of the most significant companies that offer business analytics services.", "Critical Capabilities for CRM and Customer Experience Implementation Service Providers": "Service providers' capabilities differ across the four use cases of commonly executed CRM and customer experience initiatives. Sourcing and vendor management leaders can use this document to choose a provider with the capabilities matching their own use case.", "Critical Capabilities for Security Information and Event Management": "SIEM solution purchases are primarily driven by threat detection use cases. Security and risk management leaders buying a SIEM solution should leverage this research to evaluate their use cases and requirements against an increasingly complex vendor landscape with varying degrees of capabilities.", "Critical Capabilities for Digital Experience Platforms": "The DXP market offers a new generation of platforms to create and continually improve user experience across digital channels. This Critical Capabilities will help application leaders responsible for customer-, employee- and partner-facing initiatives find an offering that aligns with their goals.", "Magic Quadrant for Network Performance Monitoring and Diagnostics": "NPMD solutions are key in helping I&O; leaders support more complex technologies and services with network visibility, performance issue detection and root cause analysis. Vendors are innovating with cloud monitoring, support for software-defined environments and more flexible deployment models.", "Magic Quadrant for Life Insurance Policy Administration Systems, North America": "Net new sales of packaged policy administration systems in North America declined in 2016, indicating a buyers' market. In a market with widely divergent product strategies, product depth, and market share, North American life insurance CIOs have many trade-offs to evaluate when selecting a vendor.", "Critical Capabilities for Operational Database Management Systems": "New products for operational DBMS use cases are maturing, challenging data and analytics leaders to select the right technology. This research and companion Magic Quadrant report combine vendor capabilities and client implementation experience to identify products that meet requirements.", "Magic Quadrant for Data Center Backup and Recovery Solutions": "Enterprise backup is among the most critical tasks for infrastructure and operations professionals. Gartner provides analysis and evaluation of the leading data center backup solution vendors that offer a range of traditional to innovative availability capabilities.", "Magic Quadrant for Enterprise Integration Platform as a Service": "The integration-platform-as-a-service market has bifurcated into: vendors with a broad go-to-market strategy that tackle a wide range of enterprise integration scenarios; vendors that focus on the more specific use cases. This Magic Quadrant focuses on the first category, enterprise iPaaS.", "Critical Capabilities for Data Quality Tools": "Market disruption caused by digital business sees new developments such as machine learning and predictive analytics emerging in data quality tools. Selecting the right tools is essential if data and analytics leaders are to exploit their business value in both traditional and emerging use cases.", "Magic Quadrant for IT Services for Communications Service Providers, Worldwide": "This Magic Quadrant helps communications service provider CIOs identify and evaluate suppliers to meet their operational IT service needs. The profiled vendors have expertise in discrete and multiyear engagements around CSPs' operational IT in a multiregional context.", "Magic Quadrant for Disaster Recovery Sites, Japan": "Enterprises continuously seek to improve their disaster recovery capability with less cost. External providers' data center facilities and services are one option for effective DR. This Magic Quadrant helps I&O; leaders address DR deployment in their business continuity management program in Japan.", "Magic Quadrant for Meeting Solutions": "Meeting solutions blend communications, collaboration and content to enable real-time group work from anywhere. This report, along with its partner Critical Capabilities research, helps application leaders pursuing digital workplace initiatives find vendors suited to their needs.", "Magic Quadrant for Enterprise File Synchronization and Sharing": "EFSS destination vendors increasingly address digital workplace enablement. IT leaders can consider this market and choose among a range of maturing options for cloud-based content collaboration and data infrastructure modernization.", "Critical Capabilities for Master Data Management Solutions": "Selecting the right packaged MDM solution requires clear understanding of how it can meet business or mission requirements. These critical capabilities for MDM solutions enable a use-case-based approach that data and analytics leaders can refer to during the vendor evaluation process.", "Magic Quadrant for Mobile App Development Platforms": "Application leaders face an increasing array of digital channels to support, from apps to virtual personal assistants. We evaluate the major MADP vendors used to accelerate and scale mobile app development, as well as to deliver post-app experiences supporting digital business.", "Magic Quadrant for Data Science and Machine-Learning Platforms": "Data science and machine-learning platforms enable organizations to take an end-to-end approach to building and deploying data science models. This Magic Quadrant evaluates 16 vendors to help you identify the right one for your organization's needs.", "Critical Capabilities for Procure-to-Pay Suites": "Procure-to-pay suite vendors are expanding their solutions to handle an ever-increasing number of financial processes and spending work streams. IT leaders responsible for applications can use this research for insight into how well P2P suite vendors support common P2P use cases.", "Critical Capabilities for Global Retail Core Banking": "Selecting a core banking system that meets a bank's specific business and technology needs remains a complex and risky undertaking. Gartner's framework of critical capabilities and use cases will guide bank CIOs through the critical task of evaluating core banking vendors and their products.", "Critical Capabilities for Life Insurance Policy Administration Systems, North America": "North American life insurance policy administration system vendors are expanding their offerings outside core administration processes. Insurance CIOs who require system support for digitalization, data analytics and integration will have to carefully study their options.", "Magic Quadrant for Meter Data Management Products": "Selecting the right solution in a rapidly maturing MDM market affected by global trends such as IoT is a challenge for CIOs and buyers of smart metering solutions. To help clients understand vendors' capabilities and deployment risks, we provide an update of product positioning.", "Magic Quadrant for Enterprise Content Management": "Shifting business requirements for digital content and new technologies are changing the ECM market. This Magic Quadrant analyzes these dynamics, their impact on ECM vendors and their implications for application leaders in charge of content management.", "Magic Quadrant for Public Cloud Storage Services, Worldwide": "Hyperscale providers are dominating the market for public cloud storage in terms of product innovation, scale and revenue. Customers should be wary of using providers that lack meaningful scale and global presence due to slow product innovation and the realistic possibility of service closure.", "Magic Quadrant for the CRM Customer Engagement Center": "Vendor positions in this Magic Quadrant reflect the growing demand for cloud-based customer service applications to support customer engagement through multiple channels, including those powered by AI. It remains the case that no vendor offers a suite that meets all global and cross-industry needs.", "Magic Quadrant for Data Quality Tools": "The data quality tools market continues to innovate, fueled by desire for cost reductions, information governance and digital business. This Magic Quadrant evaluates 16 vendors to help you find the most suitable one for your organization's needs and deliver greater business value.", "Magic Quadrant for Integrated Revenue and Customer Management for CSPs": "We rate solutions that provide billing, customer care, rating, charging, pricing, partner relationship management, policy management, mediation, self-service, analytics and other related functions. Target buyers are communications service provider CIOs.", "Magic Quadrant for Managed Security Services, Worldwide": "Security and risk management leaders considering managed security services should use this Magic Quadrant to help identify and evaluate providers with effective threat detection and compliance capabilities, and their ability to deliver services globally.", "Magic Quadrant for Cloud ERP for Product-Centric Midsize Enterprises": "The market for ERP suites for product-centric enterprises is shifting from on-premises deployments to cloud services. Application leaders in midsize enterprises should use this Magic Quadrant to identify viable vendors and solutions for moving ERP business processes to the cloud.", "Critical Capabilities for Contact Center Infrastructure, Worldwide": "Application leaders in customer service should consider today's contact center infrastructure as a legitimate option for holistically managing both employees and the increasing number of communications channels with customers. We present three use cases that represent the most common configurations.", "Magic Quadrant for Digital Experience Platforms": "Organizations are looking to use DXPs as they move from web-centric to more pervasive, multichannel digital experiences. This Magic Quadrant will help those responsible for a range of customer-, employee- and partner-facing initiatives find the most suitable vendor for their needs.", "Critical Capabilities for Network Services, Asia/Pacific": "Enterprises with regional networking requirements in Asia/Pacific have a wide choice of service providers. I&O; leaders responsible for WAN sourcing should evaluate these provider's newly available services such as direct cloud connections, hybrid WAN, SD-WAN, vCPE and NFV services.", "Critical Capabilities for Enterprise Content Management": "ECM solutions must address a range of user constituencies, within and outside the enterprise, while meeting a broad set of functional requirements. This document will help application leaders of ECM initiatives identify the solutions they can deploy to address uses important to their organizations.", "Magic Quadrant for Operational Database Management Systems": "After rapid expansion of vendors and features, players in the operational DBMS market continue converging toward feature parity. Data and analytics leaders will be interested in the lack of Visionaries, competition in the Challengers quadrant and the maturing cloud capabilities among these vendors.", "Magic Quadrant for Integrated IT Portfolio Analysis Applications": "CIOs and IT leaders must balance IT investments and resource usage against strategic IT needs across a complex, interrelated set of portfolios. The IIPA software market offers tools that unlock insights into the true state of the overall IT portfolio and the impact of portfolio-level decisions.", "Magic Quadrant for Data Center Networking": "Data center networking continues to evolve, with increasing choices for open and disaggregated network solutions, while other vendors aim for more closed, proprietary systems. Enterprises should evaluate different vendor approaches and architectures, with a particular focus on software capabilities.", "Magic Quadrant for General-Purpose Disk Arrays": "Storage vendor consolidation, competition from SDS vendors and cloud providers, and new sales and support models are continuing to change the storage market. I&O; leaders who understand the opportunities and risks created by these changes will make better infrastructure refresh decisions.", "Magic Quadrant for Multichannel Campaign Management": "Marketing leaders will find a host of new vendors in this year's Magic Quadrant for multichannel campaign management. Vendors are focused on integrating machine learning, personalization and ad tech capabilities into big data foundations for deeper customer engagement.", "Critical Capabilities for Unified Communications as a Service, Global": "UCaaS products vary in richness of services, scalability, functionality, regional coverage and ability to address different use cases. To assist application leaders in their UCaaS vendor selection process, we evaluated 15 vendors using 10 critical capabilities and four use cases.", "Critical Capabilities for Managed Workplace Services, Europe": "As digital capabilities become increasingly important, choosing the right managed workplace service provider involves an in-depth understanding of their overall capabilities. Sourcing and vendor management leaders can use this research to quickly find suitable providers for specific needs.", "Critical Capabilities for P&C; Core Platforms, North America": "P&C; insurance CIOs have broadened the scope of legacy modernization efforts beyond traditional core systems to key areas such as customer experience and partner ecosystems. Vendors are responding with expanded offerings that form core platforms, but uneven capabilities will complicate selection.", "Magic Quadrant for IT Service Support Management Tools": "IT service support management tools are vital for infrastructure and operations organizations to manage support and delivery of IT services. This research profiles key vendors of enterprise ITSSM tools to help I&O; leaders make better selections.", "Critical Capabilities for IT Service Support Management Tools": "IT service support management tools enable infrastructure and operations organizations to support and deliver IT services. To choose the correct tool, I&O; leaders should determine which of the popular ITSSM products are best-suited to their I&O; maturity levels.", "Magic Quadrant for Digital Commerce": "The number of digital commerce platform vendors continues to grow along with the breadth of those platforms, adding to the complexity of vendor evaluations. This report evaluates 21 providers of digital commerce platforms to assist application leaders supporting digital commerce.", "Critical Capabilities for Wired and Wireless LAN Access Infrastructure": "Wired and wireless LAN vendors have differing abilities to meet mobile enterprise requirements. Gartner has examined 16 vendors to determine how each addresses the needs of infrastructure and operations leaders for five distinct enterprise use cases, based on five critical capabilities.", "Magic Quadrant for Cloud HCM Suites for Midmarket and Large Enterprises": "HCM suites enable core HR, payroll, talent, workforce management and HR service delivery processes. Application leaders in entities with over 1,000 workers and emerging global needs that are pursuing a cloud HCM strategy should use this research to help identify vendors for further evaluation.", "Critical Capabilities for Endpoint Protection Platforms": "Endpoint protection is evolving to address security architecture tasks such as hardening, investigation, incident detection and incident response. Security and risk management leaders should evaluate EPP vendors' ability to keep up with modern endpoint threats and their deployment requirements.", "Critical Capabilities for Sales Performance Management": "SPM solutions maximize sales operational efficiencies, are gaining in effectiveness and align go-to-market plans with sales execution. To assist application leaders in selecting SPM solutions, Gartner has evaluated the capabilities of 11 vendors, covering four use cases and 10 critical capabilities.", "Magic Quadrant for Application Security Testing": "DevSecOps, modern web application design and high-profile breaches are affecting the growing application security testing market. Security and risk management leaders will need to meet tighter deadlines and test more-complex applications by integrating and automating AST in the software life cycle.", "Magic Quadrant for Integrated Systems": "Hyperconvergence is disrupting the integrated system market, with major system vendors joining the growing number of startups (some of which are now mature). I&O; leaders should still recognize a role for solutions based on SANs and either blades or rack servers, depending on workload requirements.", "Critical Capabilities for Enterprise Information Archiving": "Enterprise information archiving products provide governance, archiving and retrieval of enterprise digital information. I&O; leaders should review suitability of the 16 EIA products evaluated here, based on the ability to support four use cases and seven critical capabilities.", "Critical Capabilities for Data Management Solutions for Analytics": "Data management solutions for analytics are continuing to improve, with key capabilities consolidating across all vendors. Real-time data analytics have moved to their own distinct use case. Data and analytics leaders can use this research to guide evaluation for modern DMSA offerings.", "Magic Quadrant for Operational Risk Management Solutions": "Security and risk management leaders are seeking to integrate their risk management solutions to gain a more holistic view of risk across the enterprise. Operational risk management solutions serve as the core element of integrated risk management.", "Magic Quadrant for Contact Center as a Service, Western Europe": "The CCaaS market in Western Europe has matured and now offers customer service organizations a range of competitive offerings to consider as substitutes for traditional on-premises contact center infrastructure. We assess 10 vendors to help you make the right choice for your business.", "Magic Quadrant for Life Insurance Policy Administration Systems, Europe": "A highly competitive market characterized by low sales has driven European policy administration vendors to extend their system offerings. Life insurance CIOs should focus their core replacement business cases on wider digital capabilities as well as legacy modernization benefits.", "Magic Quadrant for CRM Lead Management": "The market for CRM lead management applications continues to grow, evolve and mature. This Magic Quadrant evaluates 17 providers to help IT leaders find the right choice for their company, in collaboration with marketing, sales and digital commerce leaders.", "Magic Quadrant for Intrusion Detection and Prevention Systems": "Security and risk management leaders should know that while IDPSs are being absorbed by firewall placements at the perimeter, they give the best protection. They're also responding to pressure from uptake of other threat defense solutions, and providing credible internal and cloud placement options.", "Magic Quadrant for Enterprise Agile Planning Tools": "Enterprise-scale agile adoption continues to grow, driving evolution in the market for planning and management. Application leaders looking to facilitate coordination and collaboration while enabling insight into their organizations' flow of work should consider enterprise agile planning tools.", "Critical Capabilities for Solid-State Arrays": "As concerns regarding their high price recede, solid-state arrays have improved performance, efficiency and manageability. Here, we analyze and evaluate 13 SSAs across five high-impact use cases and quantify product attractiveness against seven critical capabilities that are important to IT leaders.", "Critical Capabilities for Data Center Backup and Recovery Solutions": "Data center backup solution evaluation is complex, because of the blend of modern and legacy systems, including backup repositories on-premises or in the cloud. I&O; leaders can maintain traditional, comprehensive backup solutions or adopt emerging solutions focusing on simplicity and performance.", "Critical Capabilities for Data and Analytics Service Providers, Worldwide": "The capabilities of service providers are uneven across the four use cases of commonly executed data and analytics service initiatives. Data and analytics leaders can improve their chances of project success by selecting a provider that aligns with their own use case.", "Critical Capabilities for Life Insurance Policy Administration Systems, Europe": "The highly competitive European vendor market continues to drive life insurance policy administration system vendors toward their own development or integration of partnership noncore solutions. Life insurance CIOs should consider these developments to help accelerate digital transformation.", "Magic Quadrant for the Wired and Wireless LAN Access Infrastructure": "Enterprise LAN vendors providing access layer connectivity must respond to changing demands. Infrastructure and operations leaders should evaluate vendors based on their ability to provide an intelligent access layer capable of network automation that addresses all of the business requirements.", "Magic Quadrant for Cloud Access Security Brokers": "Cloud access security brokers have become an essential element of any cloud security strategy, helping organizations govern the use of cloud and protect sensitive data in the cloud. Security and risk management leaders should align CASB vendors to address specific use-case requirements.", "Critical Capabilities for Application Performance Monitoring Suites": "Application performance monitoring suite use and influence continue to grow beyond IT operations. Here, we evaluate APM suite capabilities across five usage scenarios to assist IT organization planners and buyers as they look to support an increasingly broad array of APM requirements.", "Magic Quadrant for Enterprise Network Firewalls": "\"Next generation\" capability has been achieved by the products in the network firewall market, and vendors differentiate on feature strengths. Buyers must consider the trade-offs between best-of-breed function and costs.", "Critical Capabilities for Enterprise Video Content Management": "Video content management serves a wide range of existing and new use cases, but no single product covers them all. Application leaders that manage video content, portals, e-commerce, collaboration and communications must assess their core needs and weigh the options against current and planned uses.", "Magic Quadrant for Endpoint Protection Platforms": "Endpoint protection is evolving to address more of Gartner's adaptive security architecture tasks such as hardening, investigation, incident detection, and incident response. Security and risk management leaders should ensure that their EPP vendor evolves fast enough to keep up with modern threats.", "Magic Quadrant for Digital Marketing Hubs": "Vendors from advertising, marketing automation and analytics are racing to deliver personalized digital marketing at scale. Marketing leaders need a system that can integrate and coordinate data and activities across channels, devices and contexts, continuously and in real time.", "Magic Quadrant for Contact Center Infrastructure, Worldwide": "Contact center infrastructure vendors are expanding their functional depth and breadth to deliver omnichannel solutions while enhancing their cloud delivery capabilities. Application leaders should evaluate vendors' technology and their ability to deliver in relevant regions.", "Critical Capabilities for Application Release Automation Solutions": "ARA solutions are rapidly evolving to meet demand for faster, better delivery of new applications and updates. This evaluation is shaped by the enterprise's need to successfully manage a diverse combination of activities, roles, skills and systems associated with automating an application release.", "Critical Capabilities for Workforce Engagement Management": "Application leaders need to elevate their commitment to enhancing employee engagement. What drives this engagement will depend on the type of work undertaken and employee personalities. Here we look at the capabilities that technology providers need to offer to support stronger employee engagement.", "Magic Quadrant for Sales Force Automation": "The sales force automation market grew 9.8% in 2015, to almost $6 billion. IT leaders supporting sales have new mobile, business process modeling, and predictive analytics options. Our evaluation of 19 products from 17 vendors will help them to choose the solution that best fits their requirements.", "Magic Quadrant for Global Retail Core Banking": "The core banking market demand for practical and enabling technology to support significant business initiatives, such as a digital banking strategy, is surging. Lack of agility and the high cost of technology are driving more banks to build the business case for core banking renewal.", "Critical Capabilities for Multichannel Campaign Management": "This year, MCCM vendors strengthened their offerings with advanced analytics, event processing infrastructure and connections to programmatic advertising. As the complexity of MCCM engagements grow, marketers must weigh the risks of emerging tactics against their potential reward.", "Magic Quadrant for Distributed File Systems and Object Storage": "IT leaders are looking to deliver agile, scalable and cost-effective storage for ever-increasing amount of unstructured data. This research assesses the key attributes, vision and executional prowess of distributed file systems and object storage vendors.", "Magic Quadrant for Data Center Outsourcing and Infrastructure Utility Services, Europe": "Gartner analyzes the execution and strategic vision of 16 leading providers and their DCO/IUS and cloud service offerings worth $19.5 billion in annual revenue in Europe. Sourcing executives can use this analysis to select a strategic provider from this market.", "Critical Capabilities for Enterprise Architecture Tools": "Leading EA tools feature new capabilities to address digital business, and accelerate support for business architecture to help achieve business-outcome-driven EA. EA and technology innovation leaders choosing EA tools should assess the tools' performance against unique organizational use cases.", "Magic Quadrant for Public Cloud Infrastructure Managed Service Providers, Worldwide": "Enterprise architecture and technology innovation leaders can benefit from selecting a high-quality-managed service provider when implementing and operating solutions on Amazon Web Services, Microsoft Azure and Google Cloud Platform.", "Magic Quadrant for Content Marketing Platforms": "Marketing leaders must boost the scale, relevance and return on content marketing investments. To meet these needs, content marketing platform vendors are merging editorial planning, content sourcing and analysis capabilities. Use this research to find a CMP that drives efficiency and results.", "Magic Quadrant for Unified Threat Management (SMB Multifunction Firewalls)": "SMB multifunction firewalls, or UTM, provide SMBs and distributed enterprises with multiple security functions in a single appliance. Network security leaders should use this research to evaluate performance, security, ease of use, local support and technology's ability to handle new SMB practices.", "Magic Quadrant for Contact Center as a Service, North America": "North America's CCaaS market has matured to provide application leaders and customer service organizations with a range of competitive offers to consider substituting for traditional on-premises contact center infrastructure. This Magic Quadrant assesses 11 vendors to help you make the right choice.", "Critical Capabilities for the CRM Customer Engagement Center": "Application leaders supporting customer relationship management and customer experience can use this research — which defines eight critical capabilities and four use-case scenarios — to select the right customer engagement center software products and vendors.", "Magic Quadrant for CRM and Customer Experience Implementation Services, Worldwide": "Customer experience and CRM implementation services continue to be in high demand, fueled by digital business transformation. Here, we position the largest customer experience and CRM consulting and implementation service providers to help enterprises identify providers that best fit their needs.", "Magic Quadrant for Warehouse Management Systems": "The WMS market is very mature, but differentiation continues to exist — most notably in usability, adaptability, intelligence and how well solutions orchestrate end-to-end logistics processes. Supply chain and IT leaders should use this research to understand the current state of the WMS market.", "Magic Quadrant for Security Information and Event Management": "Security and risk management leaders are implementing and expanding SIEM to improve early targeted attack detection and response. Advanced users seek SIEM with advanced profiling, analytics and response features.", "Magic Quadrant for Small Cell Equipment": "Via deployment of small cells, CSPs are now meeting the increasing demands of subscribers in terms of both network capacity and coverage. We assess 15 vendors of LTE and 3G femtocells and picocells plus carrier Wi-Fi equipment, and we give guidance to infrastructure and operations leaders.", "Magic Quadrant for Transportation Management Systems": "Controlling transportation costs, creating internal efficiencies, increasing visibility and securing transport capacity are currently the top motivators for investing in a TMS. Supply chain leaders should use this research to evaluate the TMS marketplace.", "Magic Quadrant for Unified Communications": "As the enterprise UC market continues to mature, we expect more consolidation and increased user expectations — prompting an emphasis on vendors' telephony capabilities and financial viability. Enterprise planners must match their own priorities to vendor strengths before committing to a solution.", "Critical Capabilities for Public Cloud Infrastructure as a Service, Worldwide": "Market-leading cloud IaaS providers deliver significantly greater capabilities than their competitors, which are relegated to niches. Enterprise architecture and technology innovation leaders must make both strategic and tactical use-case-specific provider selections.", "Magic Quadrant for Business Continuity Management Planning Software, Worldwide": "The BCMP software market — with a global market revenue estimate of $250 million — is broadening its capabilities and becoming closer to operational risk management solutions. Gartner's Magic Quadrant on this growing market evaluates 13 vendors to help in your vendor selection process.", "Critical Capabilities for Meeting Solutions": "Meeting solutions can be used in many scenarios, from internal collaboration to presentations, training and large events. Application leaders must examine the use cases that will drive their requirements for a portfolio of offerings.", "Magic Quadrant for Cloud Infrastructure as a Service, Japan": "This new Magic Quadrant for cloud IaaS focuses on the Japanese market, because its players, market characteristics and situations are different from the global market. Gartner recommends I&O; leaders use this research to assess cloud IaaS offerings by key players in Japan.", "Critical Capabilities for General-Purpose, High-End Storage Arrays": "This research assesses the capabilities of high-end storage arrays and evaluates products against key use cases of interest to infrastructure and operations. When choosing storage arrays, I&O; leaders should weigh these ratings in the context of their vendor ecosystem.", "Magic Quadrant for Enterprise Information Archiving": "Compliance, discovery and preservation are key drivers of the enterprise information archiving market, which now covers email, social media, IM, file, SMS and voice. I&O; leaders should leverage this research to assess vendors' products, services and capabilities before sourcing EIA solutions.", "Magic Quadrant for Workforce Engagement Management": "A growing market awareness of the importance of the employees in customer engagement centers is triggering an adjustment in the technologies needed to manage their day-to-day roles. Our vendor evaluation will help sourcing and vendor management leaders make the right choice for their organizations.", "Critical Capabilities for General-Purpose, Midrange Storage Arrays": "Eight critical product attributes enable infrastructure and operations leaders to quantify storage array product attractiveness across user scenarios. I&O; leaders should use this methodology with specific weightings adjusted to reflect their priorities and requirements and optimize array selection.", "Magic Quadrant for Data Management Solutions for Analytics": "Disruption is accelerating in this market, with more demand for broad solutions that address multiple data types and offer distributed processing and repository. Cloud solutions are also gaining traction. We help data and analytics leaders to weigh up the vendors in an increasingly dynamic space.", "Critical Capabilities for Software Test Automation": "Selecting effective test automation tools is becoming more critical as business demands for faster application delivery and high quality intensify. This research helps application leaders who are modernizing software development to evaluate test automation tools across five common testing use cases.", "Critical Capabilities for Operational Risk Management Solutions": "Operational risk management solutions are integrated risk management solutions focused on more formal ORM practices as a key component of a broader enterprise risk management program. Security and risk management leaders should use this research to focus their ORM solution evaluation efforts.", "Critical Capabilities for Application Security Testing": "Application security testing evolves from supporting basic web app testing to enabling DevSecOps, and securing mobile and single page apps. Security and risk management leaders must select AST solutions focusing on SDLC integration, software composition analysis, automation and speed.", "Critical Capabilities for Data Science and Machine Learning Platforms": "The functions and features of data science and machine learning platforms are evolving quickly to keep pace with a highly innovative and hyped space. This research helps data and analytics leaders evaluate 17 data science and machine learning platforms across 15 critical capabilities.", "Magic Quadrant for Data Integration Tools": "It's not acceptable for architects or developers to use only postdeployment data resolution. The need for rapid data integration requires tools and platforms with increased ability to read, analyze, and react to local and foreign metadata in a dynamic model with distributed processing capabilities.", "Magic Quadrant for Web Content Management": "Digitalization brings both new opportunities and confusion to even the most carefully planned selection processes for WCM. CIOs and IT leaders aiming to boost the effectiveness of their digital business strategy should use this document to help them select the most appropriate vendor and solution.", "Magic Quadrant for IT Risk Management Solutions": "The ITRM market has seen increased demand due to cybersecurity initiatives and board risk oversight. Security and risk management leaders must navigate a complex landscape of deployment and pricing models, as well as ITRM buyers' process maturity needs.", "Magic Quadrant for Web Application Firewalls": "The WAF market is growing, with new use cases and security requirements ranging from \"good enough\" security for compliance to protection against targeted attacks. Enterprise security teams should evaluate how WAFs can provide high security that is also easy to consume and manage.", "Critical Capabilities for Talent Management Suites": "Talent management suite providers continue to add functionality to meet the growing demands of the digital workplace. Application leaders responsible for HR should focus on a product's critical capabilities when evaluating the vendors in this maturing market.", "Magic Quadrant for Configure, Price and Quote Application Suites": "Gartner estimates that market revenue for configure, price and quote software was approximately $878 million in 2016, with growth of 20% per year expected through 2020. Our evaluation of 11 key vendors will help application leaders choose the solution that best meets their cloud CPQ requirements.", "Magic Quadrant for Sales and Operations Planning Systems of Differentiation": "This Magic Quadrant examines the main vendors that provide S&OP; systems of differentiation. Supply chain leaders in IT can use this report when evaluating and selecting such a system to help enable Stage 4 S&OP; maturity for their business.", "Magic Quadrant for Security Awareness Computer-Based Training": "People influence security far more than any technology or policy. Security leaders must invest in tools that increase security awareness and influence behavior to support critical security business objectives through computer-based training.", "Critical Capabilities for Field Service Management": "We evaluate vendor products for three common use cases using nine product capabilities. Application leaders supporting field service initiatives as part of the customer experience should use this research and its companion Magic Quadrant as part of a broader vendor evaluation process.", "Magic Quadrant for Cloud Infrastructure as a Service, Worldwide": "The global market for cloud IaaS has consolidated around hyperscale service providers. Infrastructure and operations leaders should adopt strategically, but consider scenario-specific providers as well.", "Magic Quadrant for Enterprise Architecture Tools": "Enterprise architecture and technology innovation leaders face unprecedented change and will likely require an EA tool to enable them to manage complexity more effectively. This research informs them of the main EA tool vendors in an evolving marketplace driven by the dynamics of digital business.", "Magic Quadrant for Application Release Automation": "Enterprise I&O; leaders looking to expand on hard-won agility gains from DevOps and other automation initiatives find that application release automation solutions provide the right mix of task automation, environment modeling and coordination capabilities.", "Critical Capabilities for Mobile Application Development Platforms": "IT faces increasing pressure to deliver a wide variety of mobile apps — quickly and cost-effectively — but the mobile tools market continues to evolve quickly. This research helps mobile and app development leaders evaluate the most appropriate MADP across four common enterprise mobile app use cases.", "Critical Capabilities for Object Storage": "Growing investments in Mode 2 IT projects and cost reduction efforts in core enterprise workloads are driving the demand for object storage. Here, we compare 12 object storage products against seven critical capabilities in use cases relevant to infrastructure and operations leaders.", "Magic Quadrant for Managed Mobility Services, Worldwide": "Over the past year, enterprises have been looking to broaden the scope for which they use a third party to manage their mobile estates. To maximize the value from MMS, I&O; leaders should use closely match their functional and operational requirements to the provider who meets them best.", "Critical Capabilities for Network Services, U.S.": "Enterprises with regional networking requirements in the U.S. have a wide choice of service providers. I&O; leaders responsible for WAN infrastructure modernization should evaluate these providers' newly available services, such as direct cloud connections, hybrid WAN, SD-WAN, vCPE and NFV services.", "Critical Capabilities for Intelligent Business Process Management Suites": "Intelligent business process management suites shorten the observation-to-action-to-outcome cycle and help business transformation leaders, business process directors, and solution architects reinvent or transform their business processes. We assess how the leading iBPMSs address the main use cases.", "Magic Quadrant for Enterprise Video Content Management": "As enterprise video content management stabilizes into an early mainstream phase of maturity, cloud and hybrid architectures dominate. Our assessment of 15 key vendors in this market will help application leaders to make the best choice for their organization's digital workplace program.", "Magic Quadrant for Procure-to-Pay Suites": "This year, specialist vendors completely dominate the procure-to-pay suite market with extensive portfolios, a superior UX and better access to innovation. Procurement, IT and supply chain leaders can use this report to identify global P2P vendors to meet their needs in the postmodern ERP era.", "Critical Capabilities for Unified Communications": "Changes to the ways people work together are redefining how IT leaders should assess the product capabilities of unified communications providers. This is placing an increased focus on single-vendor platforms to meet the majority of core UC functional requirements.", "Critical Capabilities for Data Integration Tools": "Data integration tools address a wide range of use cases that rely on key data delivery capabilities for their success. Application leaders need to understand the relative strengths that vendors exhibit across these capabilities in order to pick the right tools for their needs.", "Magic Quadrant for Network Services, Global": "Driven by cloud IT service adoption, the market for global enterprise network services is undergoing a generational shift in both technologies and the provider landscape. Infrastructure and operations leaders must adapt their network sourcing approaches to reflect this transformation.", "Critical Capabilities for Managed Workplace Services, North America": "This research evaluates 21 service providers on three critical capabilities across three use cases concerning their ability to provide managed workplace services. This research helps sourcing and vendor management leaders select the best MWS vendor for their specific needs.", "Magic Quadrant for Access Management, Worldwide": "The access management market has evolved beyond supporting traditional web applications to support mobile applications and APIs, as well as adding contextual and adaptive access features. Vendors offering an IDaaS option outnumber those that don't, and now there are more choices than ever.", "Magic Quadrant for Application Performance Monitoring Suites": "As historically dominant vendors revamp their APM suites with analytics, machine learning and cloud-based delivery, I&O; leaders will find that the differences among the leading vendors and between Leaders and Challengers are less defined than they have been in previous years.", "Magic Quadrant for Global Digital Marketing Agencies": "To match the CMO's broader remit and fill critical gaps, marketing agencies and consulting firms are expanding their digital transformation capabilities. Marketing leaders seeking a partner for global marketing strategy and execution should use these insights to guide agency selection.", "Magic Quadrant for P&C; Core Platforms, North America": "The North American market for P&C; core systems has consolidated as policy, billing and claims management modules have become increasingly commoditized. Buyer attention and vendor investment have shifted to broader platform capabilities, supporting customer engagement and more effective use of data.", "Magic Quadrant for Utilities Customer Information Systems": "We provide updated vendors' positioning in this important utility software market. CIOs should use this research to identify vendors that address evolving business needs in billing and customer service areas such as rising consumers' expectations and the impact of sector digital transformation.", "Critical Capabilities for Identity Governance and Administration": "IGA tools control digital identities linked to accounts and entitlements maintained in systems enterprisewide. Security and risk management leaders responsible for identity and asset management programs should evaluate critical capabilities during IGA tool selection processes.", "Magic Quadrant for Enterprise High-Productivity Application Platform as a Service": "High-productivity application platform as a service continues to increase its footprint across enterprise IT as businesses juggle the demand for applications, digital business requirements and skill set challenges. We examine these market forces and the leading enterprise vendors for such platforms.", "Magic Quadrant for Talent Management Suites": "Talent management suites help enterprises manage the key workforce processes of plan to source, acquire to onboard, perform to reward, and assess to develop. Chief HR officers and HR IT leaders developing workforce strategies should use this research to help them identify key and best-fit vendors.", "Magic Quadrant for Supply Chain Planning System of Record": "This Magic Quadrant examines vendors that provide supply chain planning system-of-record solutions. Supply chain and IT leaders can use this research when evaluating and selecting an SCP system to underpin their journey to Stage 3 SCP maturity and beyond.", "Magic Quadrant for Intelligent Business Process Management Suites": "Intelligent business process management suites use actionable, real-time insights from operations intelligence to augment the orchestration and automation of adaptive business processes. They help application leaders deliver better business outcomes by improving and transforming business processes.", "Magic Quadrant for Data Center Outsourcing and Infrastructure Utility Services, North America": "Gartner analyzed 19 service providers — with a combined annual revenue of nearly $18.8 billion — on their vision and ability to deliver DCO/IUS services in North America. Sourcing and vendor management leaders should use this analysis in their selection process.", "Magic Quadrant for Operations Support Systems": "This Magic Quadrant rates major vendors that sell end-to-end OSSs to communications service providers in the global marketplace. The OSS becomes a critical incubator that enables CSPs to shift from traditional to digital service provider.", "Critical Capabilities for Integrated Systems": "This research focuses on 15 critical capabilities and four use cases for infrastructure and operations leaders to assess product features and functions. I&O; leaders should align their project portfolios with the use cases, rationalize technology and vendor choices, and standardize across use cases.", "Magic Quadrant for Insight Engines": "Insight engines provide more-natural access to information for knowledge workers and other constituents in ways that enterprise search has not. Application leaders will benefit from comparing insight engine and search vendors with their own current and future needs.", "Magic Quadrant for Application Testing Services, Worldwide": "Application testing service outsourcing is a mature market, which continues to evolve with offerings tailored to support digitalization. Sourcing managers can use this Magic Quadrant to develop a shortlist of service providers appropriate for the desired scope of work.", "Magic Quadrant for Secure Web Gateways": "On-premises appliances continue to rule the SWG market, with a 71% market share (as measured by revenue). However, cloud-based SWG services are growing more rapidly, with a five-year historical compound annual growth rate of 32%, versus only 5% for appliances.", "Magic Quadrant for Strategic Sourcing Application Suites": "As end users increasingly require integrated suites and consumerlike user experiences to support and automate their strategic sourcing processes, vendors are investing to meet these expectations. Application leaders for procurement can use this report to assess the top solutions in this market.", "Magic Quadrant for Solid-State Arrays": "Solid-state arrays have matured beyond performance-oriented workloads, and the benefits are now compelling for all primary storage plus old and new unexpected workloads. This Magic Quadrant will help IT leaders better understand SSA vendors' positioning in the market.", "Critical Capabilities for Network Performance Monitoring and Diagnostics": "NPMD tools enable infrastructure and operations organizations to support and deliver IT services. To choose the correct tool, I&O; leaders responsible for network performance should determine which of the popular NPMD products are best-suited to their requirements and maturity level.", "Critical Capabilities for Enterprise File Synchronization and Sharing": "EFSS continues to evolve its support for common use cases: workforce productivity, extended collaboration and infrastructure modernization. As capabilities expand, the fit gap for EFSS choices is widening, requiring application leaders to develop a strategic approach to EFSS buying and deployment.", "Magic Quadrant for Managed Hybrid Cloud Hosting, Asia/Pacific": "Managed cloud providers in Asia/Pacific are beginning to introduce early hybrid cloud capabilities. This Magic Quadrant helps infrastructure and operations leaders choose providers that can support their use cases and geographic requirements.", "Magic Quadrant for Master Data Management Solutions": "The MDM market is progressing toward all-encompassing solutions at the same time as the need to apply MDM capabilities to more than just master data is complicating matters. This Magic Quadrant evaluates 11 vendors to help you identify the most suitable one(s) for your needs.", "Magic Quadrant for Data Center Outsourcing and Infrastructure Utility Services, Asia/Pacific": "Gartner assesses the top eight panregional providers of data center outsourcing in Asia/Pacific with a proven ability to deliver in multiple regional countries. Our analysis of the market, its providers and their services will help sourcing executives choose a data center provider.", "Critical Capabilities for Web Content Management": "Organizations find little differentiation in WCM products, yet selecting the right product remains complex. Application leaders responsible for CRM and customer experience need to pay extra close attention to long-range future plans in order to make the right choice today.", "Magic Quadrant for Cloud Core Financial Management Suites for Midsize, Large and Global Enterprises": "The core financial management suites market is transitioning from traditional on-premises deployment to cloud services. Application leaders in midsize, large and global enterprises should use this new Magic Quadrant to identify viable solutions for moving core finance processes to the cloud.", "Magic Quadrant for Software Test Automation": "The need to support faster time to market with higher quality is driving the demand for effective functional test automation tools. We evaluate vendors in this space to help application leaders who are modernizing software development select test automation tools that best match their needs.", "Magic Quadrant for Enterprise Mobility Management Suites": "Enterprise mobility management suites connect mobile devices to enterprise workflows while supporting the perpetual growth in device numbers and types. I&O; leaders responsible for mobile and endpoint strategies, must maintain focus on near- and long-term goals in this rapidly changing market.", "Critical Capabilities for Managed Mobile Services, Global": "Enterprise spending on mobile device outsourcing is expected to grow from $4.8 billion in 2017 to $8.2 billion in 2021, which is an 88% increase. To build and sustain their mobile estates, infrastructure and operations leaders should demand more from providers and develop their sourcing approaches.", "Critical Capabilities for Content Marketing Platforms": "As brands demand greater content marketing scale, relevance and ROI, marketing leaders must balance operational efficiency with performance. Use this research to evaluate your organization's content marketing needs and identify solutions aligned to business goals.", "Magic Quadrant for Field Service Management": "Vendors' positions in this Magic Quadrant reflect the demand to align technicians and contractors using technologies like AI, streaming video and the Internet of Things, for effectiveness in all interactions. It is more important than ever to identify vendors that can adapt new technologies for FSM.", "Magic Quadrant for Identity Governance and Administration": "Several vendors are accelerating efforts to offer cloud-delivered IGA, improve analytics and align with PAM products. Security and risk management leaders responsible for IAM should be aware of functional differences and trade-offs between on-premises and cloud-delivered IGA and plan accordingly.", "Critical Capabilities for Network Services, Pan-European": "Enterprises' digital business initiatives drive increased adoption of IaaS and SaaS, and Pan-European network service providers' offers are shifting in response. To maximize agility, I&O; leaders must evolve their network architectures and sourcing approaches.", "Magic Quadrant for Sales Performance Management": "The SPM software market grew 5% in 2016 to an estimated $753 million. Application leaders supporting sales should focus on sales incentive compensation in the short term, but also support use cases for operations, planning and corporate performance management in the midterm."}